## Plan Result (prod-prod)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 8 to add, 0 to change, 8 to destroy.</code></pre>

* Create
  * module.apply-to-court-about-child-arrangements-c100.azurerm_dns_cname_record.this[&#34;afdverify.www&#34;]
  * module.apply-to-court-about-child-arrangements-c100.azurerm_dns_cname_record.this[&#34;cdnverify.www&#34;]
  * module.apply-to-court-about-child-arrangements-c100.azurerm_dns_cname_record.this[&#34;em5901.mail-prl&#34;]
  * module.apply-to-court-about-child-arrangements-c100.azurerm_dns_cname_record.this[&#34;s1._domainkey.mail-prl&#34;]
  * module.apply-to-court-about-child-arrangements-c100.azurerm_dns_cname_record.this[&#34;s2._domainkey.mail-prl&#34;]
  * module.apply-to-court-about-child-arrangements-c100.azurerm_dns_cname_record.this[&#34;www&#34;]
  * module.apply-to-court-about-child-arrangements-c100.azurerm_dns_zone.zone
  * module.apply-to-court-about-child-arrangements-c100.azurerm_role_assignment.dnszonecontributer
* Delete
  * module.childarrangement-familyinjunction.azurerm_dns_cname_record.this[&#34;afdverify.www&#34;]
  * module.childarrangement-familyinjunction.azurerm_dns_cname_record.this[&#34;cdnverify.www&#34;]
  * module.childarrangement-familyinjunction.azurerm_dns_cname_record.this[&#34;em5901.mail-prl&#34;]
  * module.childarrangement-familyinjunction.azurerm_dns_cname_record.this[&#34;s1._domainkey.mail-prl&#34;]
  * module.childarrangement-familyinjunction.azurerm_dns_cname_record.this[&#34;s2._domainkey.mail-prl&#34;]
  * module.childarrangement-familyinjunction.azurerm_dns_cname_record.this[&#34;www&#34;]
  * module.childarrangement-familyinjunction.azurerm_dns_zone.zone
  * module.childarrangement-familyinjunction.azurerm_role_assignment.dnszonecontributer




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.apply-to-court-about-child-arrangements-c100.azurerm_dns_cname_record.this["afdverify.www"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.www"
      + record              = "afdverify.hmcts-prod.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "apply-to-court-about-child-arrangements-c100.service.gov.uk"
    }

  # module.apply-to-court-about-child-arrangements-c100.azurerm_dns_cname_record.this["cdnverify.www"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cdnverify.www"
      + record              = "cdnverify.hmcts-apply-to-court-about-child-arrangements-c100-shutter-prod.azureedge.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "apply-to-court-about-child-arrangements-c100.service.gov.uk"
    }

  # module.apply-to-court-about-child-arrangements-c100.azurerm_dns_cname_record.this["em5901.mail-prl"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "em5901.mail-prl"
      + record              = "u24999813.wl064.sendgrid.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "apply-to-court-about-child-arrangements-c100.service.gov.uk"
    }

  # module.apply-to-court-about-child-arrangements-c100.azurerm_dns_cname_record.this["s1._domainkey.mail-prl"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "s1._domainkey.mail-prl"
      + record              = "s1.domainkey.u24999813.wl064.sendgrid.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "apply-to-court-about-child-arrangements-c100.service.gov.uk"
    }

  # module.apply-to-court-about-child-arrangements-c100.azurerm_dns_cname_record.this["s2._domainkey.mail-prl"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "s2._domainkey.mail-prl"
      + record              = "s2.domainkey.u24999813.wl064.sendgrid.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "apply-to-court-about-child-arrangements-c100.service.gov.uk"
    }

  # module.apply-to-court-about-child-arrangements-c100.azurerm_dns_cname_record.this["www"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www"
      + record              = "hmcts-prod.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 120
      + zone_name           = "apply-to-court-about-child-arrangements-c100.service.gov.uk"
    }

  # module.apply-to-court-about-child-arrangements-c100.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "apply-to-court-about-child-arrangements-c100.service.gov.uk"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.apply-to-court-about-child-arrangements-c100.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2608a08f-b9d5-45a8-b641-207f574a0b60"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.childarrangement-familyinjunction.azurerm_dns_cname_record.this["afdverify.www"] will be destroyed
  # (because azurerm_dns_cname_record.this is not in configuration)
  - resource "azurerm_dns_cname_record" "this" {
      - fqdn                = "afdverify.www.childarrangement-familyinjunction.service.gov.uk." -> null
      - id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnszones/childarrangement-familyinjunction.service.gov.uk/CNAME/afdverify.www" -> null
      - name                = "afdverify.www" -> null
      - record              = "afdverify.hmcts-prod.azurefd.net" -> null
      - resource_group_name = "reformmgmtrg" -> null
      - tags                = {} -> null
      - ttl                 = 300 -> null
      - zone_name           = "childarrangement-familyinjunction.service.gov.uk" -> null
    }

  # module.childarrangement-familyinjunction.azurerm_dns_cname_record.this["cdnverify.www"] will be destroyed
  # (because azurerm_dns_cname_record.this is not in configuration)
  - resource "azurerm_dns_cname_record" "this" {
      - fqdn                = "cdnverify.www.childarrangement-familyinjunction.service.gov.uk." -> null
      - id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnszones/childarrangement-familyinjunction.service.gov.uk/CNAME/cdnverify.www" -> null
      - name                = "cdnverify.www" -> null
      - record              = "cdnverify.hmcts-childarrangement-familyinjunction-shutter-prod.azureedge.net" -> null
      - resource_group_name = "reformmgmtrg" -> null
      - tags                = {} -> null
      - ttl                 = 300 -> null
      - zone_name           = "childarrangement-familyinjunction.service.gov.uk" -> null
    }

  # module.childarrangement-familyinjunction.azurerm_dns_cname_record.this["em5901.mail-prl"] will be destroyed
  # (because azurerm_dns_cname_record.this is not in configuration)
  - resource "azurerm_dns_cname_record" "this" {
      - fqdn                = "em5901.mail-prl.childarrangement-familyinjunction.service.gov.uk." -> null
      - id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnszones/childarrangement-familyinjunction.service.gov.uk/CNAME/em5901.mail-prl" -> null
      - name                = "em5901.mail-prl" -> null
      - record              = "u24999813.wl064.sendgrid.net" -> null
      - resource_group_name = "reformmgmtrg" -> null
      - tags                = {} -> null
      - ttl                 = 300 -> null
      - zone_name           = "childarrangement-familyinjunction.service.gov.uk" -> null
    }

  # module.childarrangement-familyinjunction.azurerm_dns_cname_record.this["s1._domainkey.mail-prl"] will be destroyed
  # (because azurerm_dns_cname_record.this is not in configuration)
  - resource "azurerm_dns_cname_record" "this" {
      - fqdn                = "s1._domainkey.mail-prl.childarrangement-familyinjunction.service.gov.uk." -> null
      - id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnszones/childarrangement-familyinjunction.service.gov.uk/CNAME/s1._domainkey.mail-prl" -> null
      - name                = "s1._domainkey.mail-prl" -> null
      - record              = "s1.domainkey.u24999813.wl064.sendgrid.net" -> null
      - resource_group_name = "reformmgmtrg" -> null
      - tags                = {} -> null
      - ttl                 = 300 -> null
      - zone_name           = "childarrangement-familyinjunction.service.gov.uk" -> null
    }

  # module.childarrangement-familyinjunction.azurerm_dns_cname_record.this["s2._domainkey.mail-prl"] will be destroyed
  # (because azurerm_dns_cname_record.this is not in configuration)
  - resource "azurerm_dns_cname_record" "this" {
      - fqdn                = "s2._domainkey.mail-prl.childarrangement-familyinjunction.service.gov.uk." -> null
      - id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnszones/childarrangement-familyinjunction.service.gov.uk/CNAME/s2._domainkey.mail-prl" -> null
      - name                = "s2._domainkey.mail-prl" -> null
      - record              = "s2.domainkey.u24999813.wl064.sendgrid.net" -> null
      - resource_group_name = "reformmgmtrg" -> null
      - tags                = {} -> null
      - ttl                 = 300 -> null
      - zone_name           = "childarrangement-familyinjunction.service.gov.uk" -> null
    }

  # module.childarrangement-familyinjunction.azurerm_dns_cname_record.this["www"] will be destroyed
  # (because azurerm_dns_cname_record.this is not in configuration)
  - resource "azurerm_dns_cname_record" "this" {
      - fqdn                = "www.childarrangement-familyinjunction.service.gov.uk." -> null
      - id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnszones/childarrangement-familyinjunction.service.gov.uk/CNAME/www" -> null
      - name                = "www" -> null
      - record              = "hmcts-prod.azurefd.net" -> null
      - resource_group_name = "reformmgmtrg" -> null
      - tags                = {} -> null
      - ttl                 = 120 -> null
      - zone_name           = "childarrangement-familyinjunction.service.gov.uk" -> null
    }

  # module.childarrangement-familyinjunction.azurerm_dns_zone.zone will be destroyed
  # (because azurerm_dns_zone.zone is not in configuration)
  - resource "azurerm_dns_zone" "zone" {
      - id                        = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/childarrangement-familyinjunction.service.gov.uk" -> null
      - max_number_of_record_sets = 10000 -> null
      - name                      = "childarrangement-familyinjunction.service.gov.uk" -> null
      - name_servers              = [
          - "ns1-05.azure-dns.com.",
          - "ns2-05.azure-dns.net.",
          - "ns3-05.azure-dns.org.",
          - "ns4-05.azure-dns.info.",
        ] -> null
      - number_of_record_sets     = 8 -> null
      - resource_group_name       = "reformMgmtRG" -> null
      - tags                      = {} -> null

      - soa_record {
          - email         = "azuredns-hostmaster.microsoft.com" -> null
          - expire_time   = 2419200 -> null
          - fqdn          = "childarrangement-familyinjunction.service.gov.uk." -> null
          - host_name     = "ns1-05.azure-dns.com." -> null
          - minimum_ttl   = 300 -> null
          - refresh_time  = 3600 -> null
          - retry_time    = 300 -> null
          - serial_number = 1 -> null
          - tags          = {} -> null
          - ttl           = 3600 -> null
        }
    }

  # module.childarrangement-familyinjunction.azurerm_role_assignment.dnszonecontributer will be destroyed
  # (because azurerm_role_assignment.dnszonecontributer is not in configuration)
  - resource "azurerm_role_assignment" "dnszonecontributer" {
      - id                   = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/childarrangement-familyinjunction.service.gov.uk/providers/Microsoft.Authorization/roleAssignments/8e3ed222-61db-9833-4cc2-b177a51aa7d2" -> null
      - name                 = "8e3ed222-61db-9833-4cc2-b177a51aa7d2" -> null
      - principal_id         = "2608a08f-b9d5-45a8-b641-207f574a0b60" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> null
      - role_definition_name = "DNS Zone Contributor" -> null
      - scope                = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/childarrangement-familyinjunction.service.gov.uk" -> null
    }

Plan: 8 to add, 0 to change, 8 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1078,"Program":"tfcmt","SHA1":"","Target":"prod-prod","Vars":{}} -->